app/Controllers/Konsultasi.php

UPDATE `konsultasi` SET `konfirmasi_admin` = 1
WHERE `tiket` = 'OuSzWD'
---
    public function konfirmasi_pengajuan($token)
    {
        // konfirmasi dari admin untuk pengajuan konsultasi
        $model = new \App\Models\KonsultasiModel();
        try {
            $model->set('konfirmasi_admin', 1)
                ->where('tiket', $token)
                ->update();