app/Models/KonsultasiModel.php

    public function getAll()
    {
        $now = date("Y-m-d");
        return $this->builder()->getWhere(['tanggal >=' => $now])->getResultArray();
---
SELECT *
FROM `konsultasi`
WHERE `tanggal` >= '2023-10-16'

    public function getByTicket($tiket)
    {
        $query = $this->builder()
            ->select("konsultasi.id AS id, tiket, nama_instansi, telepon, keperluan, tanggal, sesi, konfirmasi_admin, token_admin, metode, user_konsultasi, user_pekerjaan, created_by, konsultasi_instansi.kategori_instansi, konsultasi_metode.nama_metode, konsultasi_pekerjaan.konsultasi_pekerjaan")
            ->join('konsultasi_instansi', 'konsultasi_instansi.id_instansi = konsultasi.kategori_instansi')
            ->join('konsultasi_metode', 'konsultasi_metode.id = konsultasi.metode', 'right')
            ->join('konsultasi_pekerjaan', 'konsultasi_pekerjaan.id_pekerjaan = konsultasi.user_pekerjaan');
        return $query->getWhere(['tiket' => $tiket])->getResultArray();
---
SELECT *
FROM `konsultasi`
WHERE `created_by` = 4